src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/СерверныеПроцедуры/Module.bsl
Функция ЦеныИзРегистраСведений(ДатаНоменклатуры, НоменклатураИзРегистра, Договор) Экспорт    Отбор = Новый Структура("Номенклатура, Договор", НоменклатураИзРегистра, Договор);    ЗначениеЦены = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаНоменклатуры, Отбор);    Возврат ЗначениеЦены.Цена;КонецФункции

Функция ОчиститьДвиженияДокументаНаСервере(Документ) Экспорт
	
	НачатьТранзакцию();
	
	Для Каждого МетаданныеРН Из Документ.Метаданные().Движения Цикл
		
		Набор = РегистрыНакопления[МетаданныеРН.Имя].СоздатьНаборЗаписей();
		
		Набор.Отбор.Найти("Регистратор").Установить(Документ);
		
		Попытка
			
			Набор.Записать();
			
		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			
			ОтменитьТранзакцию();
			
			Возврат ТекстОшибки;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат "";
	
КонецФункции
